<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Types
    |--------------------------------------------------------------------------
    */

    'payment' => 'รับชำระแทน',
    'transfer' => 'โอนเงิน',

    /*
    |--------------------------------------------------------------------------
    | Statuses
    |--------------------------------------------------------------------------
    */

    'pending' => 'รอชำระเงิน',
    'processing' => 'กำลังดำเนินการ',


    'paid' => 'ชำระเงินแล้ว',

    'successful' => 'สำเร็จ',
    'failed' => 'ล้มเหลว',

    'pending_settlement' => 'ยังไม่ได้จัดการ',
    'settled' => 'จัดการแล้ว',

    /*
    |--------------------------------------------------------------------------
    | Fields
    |--------------------------------------------------------------------------
    */

    'type' => 'ประเภท: :type',
    'trade_no' => 'หมายเลขคำสั่งซื้อ: :id',
    'out_trade_no' => 'หมายเลขคำสั่งซื้อของร้านค้า: :id',
    'created_at' => 'เวลาสั่งซื้อ: :time',
    'amount' => 'จำนวนเงิน: :amount',
    'total_fees' => 'ค่าบริการ: :amount',
    'currency' => 'สกุลเงิน: :code',
    'status' => 'สถานะคำสั่งซื้อ: :status',

    'paid_at' => 'เวลาชำระเงิน: :time',
    'settlement_amount' => 'จำนวนเงินจัดการ: :amount',
    'settlement_status' => 'สถานะการจัดการ: :status',
    'settled_at' => 'เวลาจัดการ: :time',

    'payee_name' => 'ผู้รับเงิน: :name',
    'payee_account' => 'บัญชีผู้รับเงิน: :account',
    'total_amount' => 'รวม: :amount',
    'balance' => 'ยอดคงเหลือ: :amount',
    'message' => 'ข้อมูล: :text',

    /*
    |--------------------------------------------------------------------------
    | Others
    |--------------------------------------------------------------------------
    */

    'no_results' => 'ไม่พบข้อมูลที่เกี่ยวข้องกับ [:query]',

];
