<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Types
    |--------------------------------------------------------------------------
    */

    'payment' => '代收',
    'transfer' => '代付',

    /*
    |--------------------------------------------------------------------------
    | Statuses
    |--------------------------------------------------------------------------
    */

    'pending' => '待支付',
    'processing' => '处理中',


    'paid' => '已支付',

    'successful' => '成功',
    'failed' => '失败',

    'pending_settlement' => '未结算',
    'settled' => '已结算',

    /*
    |--------------------------------------------------------------------------
    | Fields
    |--------------------------------------------------------------------------
    */

    'type' => '类型：:type',
    'trade_no' => '订单号: :id',
    'out_trade_no' => '商户订单号：:id',
    'created_at' => '下单时间：:time',
    'amount' => '金额：:amount',
    'total_fees' => '服务费：:amount',
    'currency' => '币种：:code',
    'status' => '订单状态：:status',

    'paid_at' => '付款时间：:time',
    'settlement_amount' => '结算金额：:amount',
    'settlement_status' => '结算状态：:status',
    'settled_at' => '结算时间：:time',

    'payee_name' => '收款人：:name',
    'payee_account' => '收款人账号：:account',
    'total_amount' => '合计：:amount',
    'balance' => '余额：:amount',
    'message' => '信息：:text',

    /*
    |--------------------------------------------------------------------------
    | Others
    |--------------------------------------------------------------------------
    */

    'no_results' => '未找到 [:query] 相关信息。',

];
